Tekla.Structures.Analysis.AnalysisLoadGroup.#ctor
Initializes a new instance of the AnalysisLoadGroup class.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupID
Gets or sets the identifier of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.CompatibleNumber
Gets or sets the load group compatible number.

Tekla.Structures.Analysis.AnalysisLoadGroup.IncompatibleNumber
Gets or sets the load group incompatible number.

Tekla.Structures.Analysis.AnalysisLoadGroup.Compatible
Gets or sets a value indicating whether the load group is compatible.
Deprecated since TS2020, use CompatibleNumber.

Tekla.Structures.Analysis.AnalysisLoadGroup.Incompatible
Gets or sets a value indicating whether the load group is incompatible.
Deprecated since TS2020, use IncompatibleNumber.

Tekla.Structures.Analysis.AnalysisLoadGroup.Direction
Gets or sets the direction of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Name
Gets or sets the name of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Type
Gets or sets the type of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.GetTypeName(Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum)
Get load group type name, translated to current language.
type: Load group type.
Returns: The load group type name, translated to current language.

Tekla.Structures.Analysis.AnalysisLoadGroup.IsSelfWeight
Check if load group is self weight load group.
Returns: True if load group is self weight load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.IsEmpty
Check if load group is empty (no loading exists).
Returns: True if load group is empty (no loading exists).